       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOBOL03.
      ********************************
      *AREA DE COMENTARIOS - REMARKS
      *AUTHOR = MARCIO ALESON
      *OBJETIVO: USO DE MASCARAS
      * IMPRIMIR FORMATADO - USO DE VIRGULA
      * DATA = 07/07/2024
      **************************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME PIC X(20) VALUE SPACES.
       77 WRK-SALARIO PIC 9(06)V99 VALUES ZEROS.
       77 WRK-SALARIO-ED PIC $ZZZ.ZZ9,99 VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-NOME FROM CONSOLE.
           ACCEPT WRK-SALARIO FROM CONSOLE.
      ************MOSTRA DADOS
           DISPLAY 'NOME ' WRK-NOME.
           MOVE WRK-SALARIO TO WRK-SALARIO-ED.
           DISPLAY 'SALARIO ' WRK-SALARIO-ED.
           STOP RUN.
