       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOBOL09.
      ******************************
      *AREA DE COMENTARIOS - REMARKS
      *AUTHOR = MARCIO
      *OBJETIVO: OPERADORES LOGICOS
      * DATA = 15/07/24
      *******************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-LARGURA PIC 9(03)V99 VALUE ZEROS.
       77 WRK-COMPRIMENTO PIC 9(03)V99 VALUE ZEROS.
       77 WRK-AREA PIC 9(03)V99 VALUE ZEROS.
       PROCEDURE DIVISION.
         DISPLAY 'LARGURA..'
         ACCEPT WRK-LARGURA.

         DISPLAY 'COMPRIMENTO..'
         ACCEPT WRK-COMPRIMENTO.

         IF WRK-COMPRIMENTO > 0 AND WRK-LARGURA >0
           COMPUTE WRK-AREA = WRK-LARGURA * WRK-COMPRIMENTO
           DISPLAY 'AREA..' WRK-AREA
         ELSE
           DISPLAY 'VALORES INVALIDOS!'
         END-IF.

       STOP RUN.
