       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOBOL04.
      ***********************************
      * AREA DE COMENTARIO - REMARKS
      * AUTHOR = MARCIO ALESON
      * OBJETIVO: OPERACOES ARTIMETICAS
      * DATA = 08/07/24
      **********************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NUM1 PIC 9(02) VALUE ZEROS.
       77 WRK-NUM2 PIC 9(02) VALUE ZEROS.
       77 WRK-RESUL PIC 9(04) VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-NUM1 FROM CONSOLE.
           ACCEPT WRK-NUM2 FROM CONSOLE.
           DISPLAY 'NUMERO 1 ' WRK-NUM1.
           DISPLAY 'NUMERO 2 ' WRK-NUM2.
           ADD WRK-NUM1 WRK-NUM2 TO WRK-RESUL.
             DISPLAY 'SOMA  ' WRK-RESUL.
           STOP RUN.
